{
  "article": {
    "title": "“Have we no shame?”: Trump’s NIH grant cuts appallingly illegal, judge rules",
    "description": "Trump ordered to restore funding for minority, LGBTQ+ health research.",
    "content": "Trump ordered to restore funding for minority, LGBTQ+ health research.",
    "url": "https://arstechnica.com/tech-policy/2025/06/judge-slams-nih-grant-cuts-as-racist-appalling-white-house-attacks-judge/",
    "publishedAt": "Tue, 17 Jun 2025 15:19:05 +0000",
    "author": "\n                    Ashley Belanger\n                ",
    "source": {
      "name": "Ars Technica",
      "url": "https://feeds.arstechnica.com/arstechnica/index"
    }
  },
  "rewritten": {
    "title": "The Audacity of Injustice: Court Slams Trump's Unlawful NIH Grant Cuts",
    "rewritten": "In a striking blow for justice, a judge has just done what many of us have been screaming from our soapboxes for months - deemed the NIH grant cuts enacted by the Trump administration as not just unethical, but appallingly illegal. These grants, which were crucial for minority and LGBTQ+ health research, were unceremoniously axed, leaving those who needed it most in the lurch. But justice, it seems, has a way of prevailing. The judge's ruling echoes the sentiments of those who have been fighting tirelessly on the front lines for equality and proper healthcare funding. 'Have we no shame?' one might ask. At this point, it's clear that the White House has been shamelessly attacking those who dare to stand up for the marginalized. But this ruling offers a glimmer of hope, a beacon of justice in an otherwise dark landscape. It's a triumphant moment - not just for those directly impacted, but for everyone who believes in fairness, equality, and common decency.",
    "summary": "A court has ruled that Trump's NIH grant cuts, which disproportionately affected minority and LGBTQ+ health research, are not only unethical but also appallingly illegal.",
    "tags": [
      "Trump",
      "NIH grants",
      "minority health",
      "LGBTQ+ health",
      "illegal funding cuts",
      "court ruling"
    ]
  },
  "score": 20
}