{
  "article": {
    "title": "Trump leaves G7 to focus on Mideast conflict. And, Vance Boelter faces federal charges",
    "description": "Trump left the G7 summit early to focus on the rapidly escalating conflict between Israel and Iran. And, the man suspected of killing a Minnesota state lawmaker faces federal murder charges.",
    "content": "Trump left the G7 summit early to focus on the rapidly escalating conflict between Israel and Iran. And, the man suspected of killing a Minnesota state lawmaker faces federal murder charges.",
    "url": "https://www.npr.org/2025/06/17/g-s1-73103/up-first-newsletter-trump-g7-iran-israel-vance-boelter-charged-purdue-pharma-opioid-epidemic",
    "publishedAt": "Tue, 17 Jun 2025 06:36:59 -0400",
    "author": "Suzanne Nuyen",
    "source": {
      "name": "NPR",
      "url": "https://www.npr.org/rss/rss.php?id=1004"
    }
  },
  "rewritten": {
    "title": "Trump's G7 Exit: A Middle East Focus or a Convenient Escape? Plus, the Vance Boelter Drama Unfolds",
    "rewritten": "<p>In a move that has become typical of his unpredictable and often controversial leadership style, President Trump once again made headlines as he took an early exit from the G7 summit. The official reason? To focus on the rapidly escalating conflict between Israel and Iran. But the question remains - is this a genuine move of international concern or a convenient escape from the G7's pressing issues?</p><p>Meanwhile, in a chilling turn of events in Minnesota, Vance Boelter, the man accused of brutally ending the life of a state lawmaker, now faces the full might of federal law. Federal murder charges have been slapped on him, plunging us into a grave reminder of the violence that festers within our society.</p>",
    "summary": "Trump abandons G7 summit early to attend to the Israel-Iran conflict, while Vance Boelter, accused of a Minnesota lawmaker's murder, faces federal charges.",
    "tags": [
      "Trump",
      "G7 Summit",
      "Middle East Conflict",
      "Israel",
      "Iran",
      "Vance Boelter",
      "Murder Charges",
      "Minnesota"
    ]
  },
  "score": 20
}